Revit 2026 API

# CurveByPointsUtilsAddCurvesToFaceRegion Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void AddCurvesToFaceRegion(
	Document document,
	IList<ElementId> curveElemIds
)
```
```vb
Public Shared Sub AddCurvesToFaceRegion (
	document As Document,
	curveElemIds As IList(Of ElementId)
)
```
```cpp
public:
static void AddCurvesToFaceRegion(
	Document^ document,
	IList<ElementId^>^ curveElemIds
)
```
```fsharp
static member AddCurvesToFaceRegion :
        document : Document *
        curveElemIds : IList<ElementId> -> unit
```

#### Parameters

document Document

curveElemIds IListElementId

#### Reference

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace